#include <STC15F2K60S2.H>//这是蓝桥杯板子用的头文件，用<REGX52.H>作为头文件也可以运行这个板子
#include "CBuzz.h"

//上面两行代码学习江科大视频5-1模块化编程就能理解了

//void main()
//{
//	Buzz_Close();//关闭蜂鸣器，因为板子上电会开启蜂鸣器，响个不停
//	while(1)//这个板子P0控制LED亮灭，江科大视频里面是P2，有区别，所以这个板子不能直接写P0=0xfe点亮第一个LED
//	{				//这个板子有个LED锁存器在控制，需要先开启锁存器，再写P0=0xfe，点亮第一个LED  
//			P2=0x9f;  //1001 1111开启LED锁存器（P2高三位为100可以开启LED锁存器） 为什么P2设置成0x9f写会开启锁存器 需要学习P2的作用（图一） 再学习138译码器 在视频4-1静态数码管里面有讲解（配合图二）
//								//正常是这样写的P2=((P2&0x1f)|0x80); 这样P2的高三位也是100，但(P2&0x1f)会防止P2本来被其他外设使用只改变高三位而其他位不变，不影响其他外设使用;
//			P0=0xfe;  //1111 1110从左边数第一个亮（图三）
//			P2&=0x1f; //0001 1111关闭锁存器
//	}
//}


void main()
{
    /*蓝桥杯单片机P0控制LED亮灭，江协视频里面是P2，
      有区别，这个板子不能直接写P0=0xfe点亮第一个LED*/
    /*板子有锁存器在控制，需要先开启锁存器，再写P0=0xfe，点亮第一个LED*/
	while(1)
	{			 
	    P2=0x9f;  
        /*1001 1111开启LED锁存器（P2高三位为100可以开启LED锁存器） 为什么P2设置成0x9f
          会开启锁存器 需要学习138译码器 在视频4-1静态数码管里面有讲解*/

				/*比赛最好是这样写：P2=((P2&0x1f)|0x80); 这样P2的高三位也是100，但(P2&0x1f)会防止P2原本  
          被其他外设使用，只改变高三位而其他位不变，不影响其他外设使用*/
	    P0=0xfe;  //1111 1110从左边数第一个LED点亮
	    P2&=0x1f; //0001 1111关闭锁存器
	}
}